{
  "pageTitle": "Professional Resume - Bob Yexley: Front End Web and Distributed Software Developer",
  "title": "Front End Web and Distributed Software Developer",
  "intro": "Family-first husband and father of three, I believe a good work-life balance is essential to maintaining the focus and productivity needed to achieve great results. I believe in using the right tool to get the job done in the most effective and efficient manner possible. In my 20+ years of experience, that has involved the use of various tools and platforms, but most recently my focus and specialization has been on native front-end web application development using HTML5, CSS3 and JavaScript connecting to flexible and powerful REST and microservices on the server. I'm passionate about delivering high-quality, user-friendly solutions that deliver business value to my customers and clients on the most ubiquitous and accessible platform available to them: the web.",
  "contactInfo": {
    "name": "Bob Yexley",
    "email": "bob@yexley.net",
    "phoneNumber": "865-399-3696",
    "website": "https://bob.yexley.net"
  },
  "toolsAndSkills": [
    { "key": "js", "name": "JavaScript", "url": "https://developer.mozilla.org/en-US/docs/Web/javascript" },
    { "key": "html", "name": "HTML", "url": "https://developer.mozilla.org/en-US/docs/Web/HTML" },
    { "key": "css", "name": "CSS", "url": "https://developer.mozilla.org/en-US/docs/Web/CSS" },
    { "key": "nodejs", "name": "node.js", "url": "https://nodejs.org" },
    { "key": "react", "name": "React", "url": "https://reactjs.org/" },
    { "key": "redux", "name": "Redux", "url": "https://redux.js.org/" },
    { "key": "vue", "name": "Vue.js", "url": "https://vuejs.org/" },
    { "key": "vuex", "name": "Vuex", "url": "https://vuex.vuejs.org/" },
    { "key": "svelte", "name": "Svelte", "url": "https://svelte.dev/" },
    { "key": "sapper", "name": "Sapper", "url": "https://sapper.svelte.dev/" },
    { "key": "webpack", "name": "Webpack", "url": "https://webpack.js.org/" },
    { "key": "mocha", "name": "Mocha", "url": "https://mochajs.org/" },
    { "key": "jest", "name": "Jest", "url": "https://jestjs.io/" },
    { "key": "gatsby", "name": "Gatsby", "url": "https://www.gatsbyjs.org/" },
    { "key": "eslint", "name": "ESLint", "url": "https://eslint.org/" },
    { "key": "express", "name": "Express", "url": "https://expressjs.com/" },
    { "key": "rest", "name": "REST", "url": "https://restfulapi.net/rest-architectural-constraints/" },
    { "key": "hypermedia", "name": "Hypermedia", "url": "https://restfulapi.net/hateoas/" },
    { "key": "docker", "name": "Docker", "url": "https://www.docker.com/" },
    { "key": "redis", "name": "Redis", "url": "https://redis.io/" },
    { "key": "rabbitmq", "name": "RabbitMQ", "url": "https://www.rabbitmq.com/" },
    { "key": "sql", "name": "SQL", "url": "https://en.wikipedia.org/wiki/SQL" },
    { "key": "nosql", "name": "NoSQL", "url": "https://en.wikipedia.org/wiki/NoSQL" },
    { "key": "sublimetext", "name": "Sublime Text", "url": "https://www.sublimetext.com/" },
    { "key": "git", "name": "Git", "url": "https://git-scm.com/" },
    { "key": "github", "name": "GitHub", "url": "https://github.com/" },
    { "key": "shell", "name": "Terminal/Command Line", "url": "https://iterm2.com/" },
    { "key": "vscode", "name": "VS Code", "url": "https://code.visualstudio.com/" },
    { "key": "electron", "name": "Electron", "url": "https://www.electronjs.org/" },
    { "key": "sass", "name": "Sass", "url": "https://sass-lang.com/" }
  ],
  "skillProficiencyCollections": [
    {
      "title": "Web Development (Advanced)",
      "skillsProficiencies": [
        "js",
        "html",
        "css",
        "sass",
        "nodejs",
        "react",
        "redux",
        "vue",
        "vuex",
        "svelte",
        "sapper",
        "webpack",
        "mocha",
        "jest",
        "gatsby",
        "eslint",
        "electron"
      ]
    },
    {
      "title": "Backend and Distributed Architecture (Intermediate)",
      "skillsProficiencies": [
        "express",
        "rest",
        "hypermedia",
        "docker",
        "redis",
        "rabbitmq",
        "sql",
        "nosql"
      ]
    },
    {
      "title": "Developer Tools (Advanced)",
      "skillsProficiencies": [
        "sublimetext",
        "git",
        "github",
        "shell",
        "vscode"
      ]
    }
  ],
  "workHistory": [
    {
      "employer": "The Art of Education University",
      "employerUrl": "https://theartofeducation.edu",
      "startDate": "October 2020",
      "endDate": "June 2022",
      "positionTitle": "Software Engineer III",
      "summary": "Senior Software Engineer leading a replatforming and modernization effort, rebuilding an existing WordPress site into a more modern architecture with a micro-services backend, and next-generation frontend using Next.js and React, dramatically improving performance, quality and maintainability.",
      "technologiesTools": [
        "js",
        "react",
        "next.js",
        "nodejs",
        "jest",
        "css",
        "python",
        "go",
        "git",
        "github",
        "stripe"
      ],
      "highlights": [
        "Designed and built a new identity system from the ground up, as the foundation of the replatforming effort.",
        "Implemented the design for a brand new marketplace experience that allowed users to purchase event tickets and digital product subscriptions, interfacing directly with Stripe as the payment gateway for the ecommerce side of the application.",
        "Evaluated, hired and mentored junior developers who made significant contributions to both replatforming and maintenance development efforts."
      ]
    },
    {
      "employer": "Amplify Exchange",
      "employerUrl": "https://amplifyexchange.com",
      "startDate": "February 2019",
      "endDate": "July 2020",
      "positionTitle": "Senior Software Engineer (On-Site and Remote)",
      "summary": "FinTech startup, built a Cryptocurrency Exchange",
      "technologiesTools": [
        "js",
        "vue",
        "vuex",
        "html",
        "css",
        "sass",
        "nodejs",
        "express",
        "jest",
        "git",
        "github"
      ],
      "highlights": [
        "Built a series of web-based UIs for facilitating the deposit, withdrawal and trading of a number of Cryptocurrency asset types (Bitcoin, Ethereum, etc)",
        "Built a number of different REST micro services supporting various exchange operations such as background checks, incentive rewards, etc"
      ]
    },
    {
      "employer": "Sparkbox",
      "employerUrl": "https://seesparkbox.com",
      "startDate": "January 2018",
      "endDate": "February 2019",
      "positionTitle": "Senior Web Developer (Remote)",
      "summary": "Web Developer specializing in working with clients to build web responsive and accessible web sites and applications with a focus on moving the web forward by building it a better way.",
      "technologiesTools": [
        "js",
        "react",
        "html",
        "css",
        "sass",
        "nodejs",
        "express",
        "jest",
        "git",
        "github"
      ],
      "highlights": [
        "Worked primarily with a Fortune 500 retail client on modernizing and improving their ecommerce platform performance by converting it to an improved component-based architecture using React."
      ]
    },
    {
      "employer": "LeanKit",
      "employerUrl": "https://leankit.com/",
      "startDate": "September 2015",
      "endDate": "December 2017",
      "positionTitle": "Senior Web Developer (Remote)",
      "summary": "Worked on maintaining the company's flagship Lean/Kanban project management product. Much of this work involved migrating legacy ASP.NET code to node.js microservices and React in the browser.",
      "technologiesTools": [
        "js",
        "react",
        "html",
        "css",
        "nodejs",
        "express",
        "mocha",
        "Flux",
        "git",
        "github"
      ],
      "highlights": [""]
    },
    {
      "employer": "Lampo Group",
      "employerUrl": "https://daveramsey.com/",
      "startDate": "November 2014",
      "endDate": "September 2015",
      "positionTitle": "Senior JavaScript Engineer (Contractor, Remote)",
      "summary": "Contracted for Ramsey Solutions as a front-end web developer helping build the SmartDollar site and application. We applied responsive design methodologies to make applications available in web browsers on any device.",
      "technologiesTools": [
        "js",
        "react",
        "html",
        "css",
        "sass",
        "webpack",
        "nodejs",
        "git",
        "github",
        "Ruby on Rails"
      ],
      "highlights": [
        "Designed and implemented a solution for modular JavaScript for the SmartDollar application using vanilla JavaScript and namespacing",
        "Designed and implemented a reporting application with React and my own implement of Flux using postal.js and the Chartist library for custom charts and graphs"
      ]
    },
    {
      "employer": "appendTo",
      "employerUrl": "",
      "startDate": "December 2012",
      "endDate": "October 2014",
      "positionTitle": "Senior JavaScript Engineer and Team Lead (Remote)",
      "summary": "Senior JavaScript Engineer and Team Lead in the Solutions Delivery group at appendTo.",
      "technologiesTools": [
        "js",
        "html",
        "css",
        "Sass",
        "Compass",
        "Knockout.js",
        "Backbone.js",
        "Cordova",
        "git",
        "github"
      ],
      "highlights": [
        "Built a large, complex single-page-application for an international client. The application made heavy use of KnockoutJS with numerous custom bindings and extensions, and custom developed modules to handle client-side routing, logging and other architectural concerns, as well as Twitter Bootstrap for UI layout (grid) and components.",
        "JavaScript module development and migration as part of a responsive re-design of a client's public web site and commerce application.",
        "UX development (JavaScript (jQuery, Knockout.JS), HTML5 and CSS3) for a customer building a large-scale custom commerce application.",
        "Built several native iPad applications using HTML5, CSS3 and JavaScript (jQuery, Backbone.js) with Cordova/PhoneGap."
      ]
    },
    {
      "employer": "Food Donation Connection",
      "employerUrl": "http://foodtodonate.com/",
      "startDate": "September 2011",
      "endDate": "December 2012",
      "positionTitle": "Senior Software Developer",
      "summary": "Built data-driven web applications and backend services. Single-page JavaScript applications using Backbone.js and jQuery, with HTML5 and LESS/CSS, calling a HTTP/Hypermedia API written with the Nancy framework in C# on the server side.",
      "technologiesTools": [
        "js",
        "html",
        "css",
        "jQuery",
        "LessCSS",
        "ASP.NET MVC",
        "NancyFx",
        "C#",
        "hypermedia"
      ],
      "highlights": [""]
    },
    {
      "employer": "Scripps Networks",
      "employerUrl": "http://scrippsnetworks.com/",
      "startDate": "July 2008",
      "endDate": "August 2011",
      "positionTitle": "Senior Software Developer",
      "summary": "Senior member of a team at Scripps Networks responsible for the development, maintenance, testing and delivery of internal customer-facing and integration software.",
      "technologiesTools": [
        "C#",
        "WinForms",
        "Silverlight",
        "ASP.NET MVC",
        "jQuery",
        "TSQL",
        "WCF",
        "BizTalk"
      ],
      "highlights": [
        "Developed an ASP.NET MVC web application to allow users to perform batch editing of media asset metadata, calling SOAP web services on the backend.",
        "Rebuilt an existing Access application using Silverlight, WCF and SQL Server with Telerik Reporting services for the maintenance and amortization of affiliate accounting data.",
        "Maintenance and development of new modules for content accounting and billing applications using C#/WinForms and SQL Server Reporting Services.",
        "Development of BizTalk and WCF services for financial application integrations."
      ]
    },
    {
      "employer": "Extreme Consulting",
      "employerUrl": "",
      "startDate": "April 2008",
      "endDate": "July 2008",
      "positionTitle": "Software Developer",
      "summary": "Our client was hosting an international event with various educational tracks that consisted of breakout sessions in different rooms (each with different, limited capacity) at a conference center. They needed an application that would allow attendees to register for the event and breakout sessions. I designed and created it for them.",
      "technologiesTools": [
        "js",
        "html",
        "css",
        "C#",
        "ASP.NET",
        "jQuery",
        "SQL Server",
        "TSQL",
        "Subversion"
      ],
      "highlights": [""]
    },
    {
      "employer": "Lexis Nexis Corporation",
      "employerUrl": "http://lexisnexis.com/",
      "startDate": "June 2006",
      "endDate": "March 2008",
      "positionTitle": "Software Developer",
      "summary": "Member of a team at LexisNexis responsible for the development of UI functionality consuming SOAP web services rendering results of public records searches for customers.",
      "technologiesTools": [
        "js",
        "html",
        "css",
        "C#",
        "ASP.NET",
        "jQuery",
        "Windows Services",
        "SQL Server",
        "TSQL",
        "Subversion",
        "CruiseControl.NET",
        "NAnt"
      ],
      "highlights": [
        "Developed an ASP.NET (C#/webforms) web UI to allow users to perform public records searches. Used jQuery to perform client side form validation and DOM manipulation.",
        "Created HTML and CSS for printable reports based on search results.",
        "Established a configuration management environment for the project using Subversion for version control and CruiseControl.NET for continuous integration, automated build and deployment.",
        "Developed a windows service to monitor database information and generate e-mail notifications to sales employees of service usage."
      ]
    },
    {
      "employer": "Lighthouse Technologies, Inc",
      "employerUrl": "",
      "startDate": "June 2005",
      "endDate": "June 2006",
      "positionTitle": "Software Engineer in Development and Test",
      "summary": "Member of a team at Lighthouse Technologies that developed a custom application for our client, Collins-Stewart. The client needed a custom financial analysis application designed and built from the ground up. It required the flexibility to be able to deal with the ever-changing financial forecasting and reporting data provided them by their financial data vendors, and the power to allow them to do complex dynamic computation and reporting on the financial data of publicly traded companies from around the globe.",
      "technologiesTools": [
        "C#",
        "WinForms",
        "SQL Server",
        "TSQL",
        "CruiseControl.NET"
      ],
      "highlights": [
        "Developed all layers of several application modules, including UI, (logical) middle-tier components, data access layer components and database artifacts (tables, views, stored procedures).",
        "Created and executed manual test scenarios for several application modules."
      ]
    },
    {
      "employer": "Northrop Grumman for Air Force Research Labs",
      "employerUrl": "",
      "startDate": "January 2002",
      "endDate": "June 2005",
      "positionTitle": "Database Administrator and Developer",
      "summary": "Member of a team of contractors supporting the Air Force Research Labs (AFRL), I performed the following duties in support of a number of applications that allowed AFRL personnel to maintain and distribute data in support of research contract management.",
      "technologiesTools": [
        "Oracle",
        "PL/SQL",
        "ColdFusion",
        "js",
        "html",
        "css"
      ],
      "highlights": [
        "Performed database administration and support for Oracle databases.",
        "Provided maintenance, new development and technical support for desktop/thick-client applications written on top of an Oracle database.",
        "Extended the availability and reach of the application by rewriting the entire application from the ground up as a web application using Macromedia ColdFusion and JavaScript."
      ]
    },
    {
      "employer": "Air Force Institute of Technology",
      "employerUrl": "http://afit.edu/",
      "startDate": "August 1997",
      "endDate": "December 2001",
      "positionTitle": "Database Administrator and Developer",
      "summary": "As a military staff member of a team at the Air Force Institute of Technology, the U.S. Air Force's graduate school for officers, I performed the following duties in support of a number of applications that allowed organization staff and faculty to maintain student education and personnel management data.",
      "technologiesTools": [
        "Oracle",
        "PL/SQL"
      ],
      "highlights": [
        "Performed database administration and support for Oracle databases.",
        "Established and documented organizational configuration management processes and procedures.",
        "Provided maintenance, new development and technical support for desktop/thick-client applications written on top of Oracle databases."
      ]
    }
  ],
  "codeSamples": {
    "intro": "You're always welcome to head over and checkout [my GitHub profile](https://github.com/ryexley) and the code samples there; but, well, there's a lot there and I feel like it might be more convenient for you if I point out some of the more well rounded repositories that you'll find there. Below you'll find a list of links to repositories, along with a brief description of what you can expect in each. I feel like this could be helpful to you in case you might be looking for something specific, like an example of some of my experience with React or node.js or something like that.",
    "items": [
      {
        "name": "Poplar",
        "url": "https://github.com/ryexley/poplar",
        "technologiesTools": ["Electron", "react", "redux", "css"],
        "description": "This project is an Electron menubar application for MacOS that I built for use in controlling a Wemo power outlet for turning a light on and off from my laptop. It's build with Electron, React and Redux."
      },
      {
        "name": "Decked Out Workout",
        "url": "https://github.com/ryexley/juniper",
        "technologiesTools": ["react", "redux", "css"],
        "description": "React/Redux web application optimized for mobile devices for facilitating a quick-and-easy workout from anywhere you are when you have time. Code walkthrough available upon request. The link above is to the code repository itself, [you can see the app itself hosted and running on Netlify](https://deckedoutworkout.netlify.com)."
      },
      {
        "name": "My Web Site",
        "url": "https://github.com/ryexley/bob-yexley-net",
        "technologiesTools": ["gatsby", "react"],
        "description": "This includes the custom React code for this resume, which I like to use as an example of my understanding of that library. The pieces for the resume are scattered around a bit, but you can find [the base page file here](https://github.com/ryexley/bob-yexley-net/tree/master/src/pages/resume.js), [the components here](https://github.com/ryexley/bob-yexley-net/tree/master/src/components/Resume), and [the raw data used to generate it here](https://github.com/ryexley/bob-yexley-net/tree/master/content/data/resume.json)."
      },
      {
        "name": "service-core",
        "url": "https://github.com/ryexley/service-core",
        "technologiesTools": ["nodejs", "express"],
        "description": "This is a library that I've put together that I use as a boilerplate for creating REST services with node.js and Express. I like it because it encapsulates the core configuration of the Express server, and allows me to simply define routes and handlers along with a configuration that I pass in to it. This library dramatically simplifies the creation and maintenance of REST services for me."
      },
      {
        "name": "Quakie",
        "url": "https://github.com/ryexley/quakie",
        "technologiesTools": ["nodejs", "express", "Postgres", "Chart.js"],
        "description": "This was a fun project that gave me a great opportunity to get more comfortable with some tools I was interested in expanding my knowledge of. At the time I wrote it, it was fantastic tool in helping me learn Express and Postgres better. There is a node.js script that iterates over a series of dates and downloads historical weather data and persists it to a Postgres database. With all of the historical weather data I was interested in persisted locally, I created a web UI with React, Webpack, postal.js, express.js, axios and Massive.js to extract the data from the database and generate graphs with weather trends using Chart.js."
      },
      {
        "name": "Various Others",
        "url": "https://github.com/ryexley",
        "technologiesTools": [],
        "description": "You'll find a number of other projects in various states of relevancy and completion. Some are no longer in use or are outdated by now, and others are the product of learning new tools and techniques, and never really got completely \"finished.\" You know how it is, right? 😉 Feel free to poke around in them anyway."
      }
    ]
  },
  "extraStuff": [
    {
      "heading": "Writing",
      "body": "Feel free to browse anything that I've written [on my web site](https://bob.yexley.net/tags). There's not a ton of stuff here, as I've pruned much of the stuff I've written over the years as it has fallen out of relevancy. I also contributed a chapter to an ebook on [Modern Web Practices](https://leanpub.com/modernwebpractices) a while back. It's almost sad how quickly technical content becomes outdated and practically irrelevant."
    },
    {
      "heading": "Air Force Career",
      "body": "I spent 11 years in the Air Force after graduating from high school. For the first 6 years I was a [Munitions Systems Specialist](https://www.airforce.com/careers/detail/munitions-systems/), at which point I cross-trained into [Communications Computer Systems Programming](https://www.airforce.com/careers/detail/computer-systems-programming/), where they taught me foundational computer programming skills. During my time in the Air Force, I spent time at various places all over the world. Here in the US I spent time in Texas, Colorado, California, Nevada, Arizona, Mississippi and Ohio. I also traveled extensively overseas to Germany, Spain, Sardinia, Saudi Arabia, Italy and Turkey. I separated from the Air Force in December of 2001 and have worked as a professional software developer ever since."
    },
    {
      "heading": "Formal Education",
      "body": "Not gon' lie, I don't have a whole lot of it. While I was in the Air Force, I did take some college courses toward an attempt to get a college degree, but it was tough to stay on top of that with as much as I was deployed during my enlistment. After getting out of the Air Force, I took a curriculum's worth of course work at [a local college](http://www.miamijacobs.edu/) near where I lived in Ohio, learning more about computer programming, to which I credit a significant portion of the foundational programming knowledge that launched my career as a developer."
    },
    {
      "heading": "That's pretty much it",
      "body": "If you've gotten this far, there really isn't a whole lot more to tell _(and I commend you)_. You're welcome to check out [the About page](https://bob.yexley.net/about) if you're interested in a little bit about me personally. Feel free to browse around the site, as it contains just about everything I'm willing to share about myself online. Beyond that, you're just gonna have to ask me. Thanks for checking out my resume! 🙂"
    }
  ]
}
